tests/data/stripe/subscription_01.json

{
    "application_fee_percent": null,
    "automatic_tax": {
        "enabled": false
    },
    "billing_cycle_anchor": 1623833153,
    "billing_thresholds": null,
    "cancel_at": null,
    "cancel_at_period_end": false,
    "canceled_at": null,
    "collection_method": "charge_automatically",
    "created": 1623833153,
    "current_period_end": 1635237953,
    "current_period_start": 1635151553,
    "customer": "cus_c3Vic2NyaXB0aW9uMQo",
    "days_until_due": null,
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "discount": null,
    "ended_at": null,
    "id": "sub_c3Vic2NyaXB0aW9uMQo",
    "items": {
        "data": [
            {
                "billing_thresholds": null,
                "created": 1623833154,
                "id": "si_c3Vic2NyaXB0aW9uMQo",
                "metadata": {},
                "object": "subscription_item",
                "plan": {
                    "active": true,
                    "aggregate_usage": null,
                    "amount": 100,
                    "amount_decimal": "100",
                    "billing_scheme": "per_unit",
                    "created": 1623335617,
                    "currency": "usd",
                    "id": "price_c3Vic2NyaXB0aW9uMQo",
                    "interval": "day",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {
                        "productSetOrder": "1"
                    },
                    "nickname": "Daily Subscription Rate 001",
                    "object": "plan",
                    "product": "prod_c3Vic2NyaXB0aW9uMQo",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "price": {
                    "active": true,
                    "billing_scheme": "per_unit",
                    "created": 1623335617,
                    "currency": "usd",
                    "id": "price_c3Vic2NyaXB0aW9uMQo",
                    "livemode": false,
                    "lookup_key": null,
                    "metadata": {
                        "productSetOrder": "1"
                    },
                    "nickname": "Daily Subscription Rate 001",
                    "object": "price",
                    "product": "prod_c3Vic2NyaXB0aW9uMQo",
                    "recurring": {
                        "aggregate_usage": null,
                        "interval": "day",
                        "interval_count": 1,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "tax_behavior": "unspecified",
                    "tiers_mode": null,
                    "transform_quantity": null,
                    "type": "recurring",
                    "unit_amount": 100,
                    "unit_amount_decimal": "100"
                },
                "quantity": 1,
                "subscription": "sub_c3Vic2NyaXB0aW9uMQo",
                "tax_rates": []
            }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_c3Vic2NyaXB0aW9uMQo"
    },
    "latest_invoice": "in_c3Vic2NyaXB0aW9uMQo",
    "livemode": false,
    "metadata": {},
    "next_pending_invoice_item_invoice": null,
    "object": "subscription",
    "pause_collection": null,
    "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
    },
    "pending_invoice_item_interval": null,
    "pending_setup_intent": null,
    "pending_update": null,
    "plan": {
        "active": true,
        "aggregate_usage": null,
        "amount": 100,
        "amount_decimal": "100",
        "billing_scheme": "per_unit",
        "created": 1623335617,
        "currency": "usd",
        "id": "price_c3Vic2NyaXB0aW9uMQo",
        "interval": "day",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
            "productSetOrder": "1"
        },
        "nickname": "Daily Subscription Rate 001",
        "object": "plan",
        "product": "prod_c3Vic2NyaXB0aW9uMQo",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
    },
    "quantity": 1,
    "schedule": null,
    "start_date": 1623833153,
    "status": "active",
    "tax_percent": null,
    "transfer_data": null,
    "trial_end": null,
    "trial_start": null
}
